artillery.yml
config:
    target: "http://localhost:3004"
    phases:

      - duration: 10
        arrivalRate: 1
        maxVusers: 1
        name: "warmup"

      - pause: 30

      - duration: 60
        arrivalRate: 10
        maxVusers: 10
        name: "10 users"

      - pause: 30

      - duration: 60
        arrivalRate: 100
        maxVusers: 100
        name: "100 users"

      - pause: 30

      - duration: 60
        arrivalRate: 1000
        maxVusers: 1000
        name: "1000 users"

scenarios:
  - name: "Testing GET REQ"
    flow:
    - get:
        url: "/api/games/1"

  - name: "Testing POST REQ"
    flow:
    - post:
        url: "/api/addGame/1"